Repository: ombremad/RelCheck
Catalog: RelCheck/Resources/Localizable.xcstrings
Source language: en
Languages: fr

# about.author.message
source: Anne Ferret (aka @ombremad) is a iOS developer, born in France, living between her birthplace and the Netherlands.\nA former tech journalist, she started a career change in 2025: she attended Apple Foundation Program Advanced and learned to code! RelCheck is one of her first apps.
fr: Anne Ferret (aka @ombremad) est une développeuse iOS, née en France, vivant entre son pays de naissance et les Pays-Bas.\nAncienne journaliste tech, elle a initié un changement de carrière en 2025 : elle a fait l’Apple Foundation Program Advanced et appris à coder ! RelCheck est une de ses premières apps.

# about.links.anneFerretWebsite
source: Anne Ferret website
fr: Site web d’Anne Ferret

# about.links.header
source: Links
fr: Liens

# about.links.relCheckOnGitHub
source: RelCheck on GitHub
fr: RelCheck sur GitHub

# about.thisApp.message
source: RelCheck (codename: notifyme) came up as a small hackathon project during Apple Foundation Program Advanced. A version 0.1 was completed in about 36 hours thanks to the effort of two people: Dembo and Anne. The latter decided to continue working on the project to improve what could be.\nThis app is made for, and dedicated to, all my ADHD and neuro-spicy people. With much love!
fr: RelCheck (nom de code : notifyme) est né en tant que petit projet de hackathon durant l’Apple Foundation Program Advanced. Une version 0.1 a été terminée en environ 36 heures, grâce aux efforts de deux personnes : Dembo et Anne. La dernière a décidé de continue à travailler sur le projet pour l’améliorer autant que possible.\nCette app est faite pour, et dédiée à, toustes mes adelphes de TDAH et neuro-atypiques. Avec amour !

# about.title
source: About
fr: À propos

# button.addContact
source: Add a contact
fr: Ajouter un contact

# button.changedDays.changeCheckIn %lld
source: Reschedule: next check-in will be in %lld days
fr: Replanifier : prochaine prise de contact dans %lld jours

# button.changedDays.keepCurrentCheckIn %@
source: Keep next check-in on %@
fr: Garder la prochaine prise de contact le %@

# button.checkIn
source: Check in
fr: Contact pris

# button.contactActions
source: Actions de contact
fr: Contact actions

# button.delete
source: Delete
fr: Supprimer

# button.edit
source: Edit
fr: Éditer

# button.save
source: Save
fr: Enregistrer

# button.settings
source: Settings
fr: Réglages

# contacts.authorizationWarning.content
source: You need to allow notifications in iOS if you want this app to work properly.
fr: Tu dois autoriser les notifications dans iOS pour que cette app fonctionne correctement.

# contacts.authorizationWarning.openSettings
source: Open iOS settings
fr: Ouvrir les paramètres iOS

# contacts.authorizationWarning.title
source: Warning
fr: Attention

# contacts.contentUnavailableCTA
source: Your contacts list is empty. Add one now!
fr: Tu n’as pas encore de contact. Crées-en un maintenant !

# contacts.contentUnavailableTitle
source: Contacts list empty
fr: Liste de contacts vide

# editContact.changedDays.message
source: Days between notifications have been changed for this contact. Do you want to apply this setting right now or wait until after your next planned check-in?
fr: L’intervalle de jours entre les notifications a été changé. Veux-tu appliquer ce changement dès maintenant ou après la prochaine prise de contact ?

# editContact.changedDays.title
source: Reschedule next check-in?
fr: Replanifier la prochaine prise de contact ?

# editContact.title
source: Edit contact
fr: Édition du contact

source: Error: Contact not found
fr: Erreur : Contact introuvable

# fastCheckIn.intro
source: Select every contact you’ve talked to in the last 24 hours.
fr: Sélectionne toutes les personnes avec qui tu as pris contact ces dernières 24 heures.

# fastCheckIn.title
source: Fast check-in
fr: Sélection rapide

# newContact.checkInFrequency.picker
source: Check-in frequency
fr: Fréquence de contact

# newContact.checkInFrequency.picker %lld
source: %lld days
fr: %lld jours

# newContact.header.checkInFrequency
source: Check-in frequency
fr: Fréquence de contact

# newContact.header.color
source: Color
fr: Couleur

# newContact.header.contactAppearance
source: Contact appearance
fr: Apparence du contact

# newContact.header.contactInformation
source: Contact information
fr: Information du contact

# newContact.header.icon
source: Icon
fr: Icône

# newContact.inputField.name
source: Name
fr: Nom

# newContact.title
source: New contact
fr: Nouveau contact

# notification.fastCheckIn.body
source: Time for your daily recap!
fr: Reviens sur tes dernières 24 heures !

# notification.fastCheckIn.title
source: Fast check-in
fr: Sélection rapide

# notification.inactivity.app.body
source: Be sure to launch RelCheck once in a while to keep notifications up-to-date!
fr: Pensez à relancer RelCheck de temps en temps pour que les notifications continuent à fonctionner !

# notification.inactivity.app.title
source: It’s been a month
fr: Ça fait un mois...

# notification.inactivity.fastCheckIn.body
source: Fast check-ins notifications will be silenced until you launch the app again.
fr: Les rappels quotidiens sont désactivés jusqu’au prochain lancement de l’app.

# notification.inactivity.fastCheckIn.title
source: Daily reminders disabled
fr: Résumé quotidien désactivé

# notification.reminder.body
source: Now’s the time to get back in touch.
fr: Il est temps de reprendre contact.

# notification.reminder.title %@
source: Say hi to %@!
fr: Dis bonjour à %@!

# onboarding.button.start
source: Start
fr: Commencer

# onboarding.ready
source: Welcome onboard!
fr: Bienvenue à bord !

# onboarding.skip
source: Skip
fr: Passer

# onboardingCard.01.message
source: Not everyone manages to stay in touch with their loved ones naturally. Some people just aren’t wired this way. That's where RelCheck come in.
fr: Tout le monde n’arrive pas à garder contact avec ses proches. Certain·es n’y arrivent pas naturellement. C’est là que RelCheck vient à la rescousse.

# onboardingCard.01.title
source: Here to help
fr: Là pour aider

# onboardingCard.02.message
source: First, add a person into the app, and define how often you want to be reminded to contact them again.
fr: D’abord, ajoute une personne dans l’app, et choisis à quelle fréquence tu veux être rappelé·e de reprendre contact.

# onboardingCard.02.title
source: Add a new contact
fr: Ajoute un nouveau contact

# onboardingCard.03.message
source: You get a notification when it’s time to get back in touch with someone.
fr: Tu reçois une notification quand il est temps de renouer le contact avec quelqu’un.

# onboardingCard.04.message
source: Talk to someone the way you want (call, text…), and simply check-in in the app. You can check-in when it’s time by tapping the notification, or early directly in the app.
fr: Parle à quelqu’un de la manière de ton choix (appel, SMS…), et indique à l’app une prise de contact. Tu peux le faire à l’échéance en cliquant sur la notification, ou à tout moment dans l’app.

# onboardingCard.04.title
source: Check-in
fr: Prise de contact

# onboardingCard.05.message
source: You can also toggle the “fast check-in" in Settings. Every day, you’ll get a notification to select quickly, of all your contacts, the ones you’ve made contact with today.
fr: Tu peux aussi activer la sélection rapide dans les Réglages. Chaque jour, tu recevras une notification pour sélectionner rapidement, parmi tous tes contacts, ceux à qui tu as parlé aujourd’hui.

# onboardingCard.05.title
source: Fast check-in
fr: Sélection rapide

# settings.about.label
source: About this app
fr: À propos de cette application

# settings.dailyFastCheckIn.label
source: Daily fast check-in
fr: Sélection rapide quotidienne

# settings.dailyFastCheckIn.subtitle
source: Every day, receive a notification allowing you to fast check-in every contact you’ve talked with in the last 24 hours.
fr: Chaque jour, reçois une notification qui permet de sélectionner rapidement toutes les personnes avec qui tu as pris contact ces 24 dernières heures.

# settings.fastCheckInHour.label
source: Reminder hour
fr: Heure de rappel

# settings.seeOnboardingAgain.label
source: See onboarding again
fr: Revoir l’introduction

# settings.title
source: Settings
fr: Réglages

# singleContact.checkInCompleted
source: Check in completed!
fr: Contact pris !

# singleContact.checkInFrequency
source: Check-in frequency
fr: Fréquence de contact

# singleContact.deleteAlert.destructiveButton
source: Delete
fr: Supprimer

# singleContact.deleteAlert.dismissButton
source: Cancel
fr: Annuler

# singleContact.deleteAlert.message
source: Do you really want to delete the contact? You cannot undo this action!
fr: Veux-tu vraiment supprimer ce contact ? Cette action est irréversible !

# singleContact.deleteAlert.title
source: Delete contact
fr: Supprimer le contact

# singleContact.didYouJustCheckInWith %@
source: Did you just check in with %@?
fr: Tu viens de prendre contact avec %@ ?

# singleContact.everyXDays %lld
source: every %lld days
fr: tous les %lld jours

# singleContact.header.checkInHistory
source: Check-in history
fr: Historique de prise de contact

# singleContact.inXDays %lld
source: in %lld days
fr: dans %lld jours

# singleContact.nextCheckIn
source: Next check-in
fr: Prochain contact prévu

# singleContact.noCheckInsYet %@
source: You haven’t checked in with %@ yet.
fr: Tu n’as pas encore pris contact avec %@.

# singleContact.overdue
source: overdue
fr: en retard
